## Отчет по лабораторной работе № 1

#### № группы: `ПМ-2402`

#### Выполнил: `Хлестов Егор Андреевич`

#### Вариант: `28`

### Cодержание:

- [Постановка задачи](#1-постановка-задачи)
- [Входные и выходные данные](#2-входные-и-выходные-данные)
- [Выбор структуры данных](#3-выбор-структуры-данных)
- [Алгоритм](#4-алгоритм)
- [Программа](#5-программа)
- [Анализ правильности решения](#6-анализ-правильности-решения)

### 1. Постановка задачи

> Программа получает на вход 4 натуральных числа A, B, C и D. Требуется проверить, образуют ли хотя
бы 3 из них арифметическую прогрессию, и если да, то вывести прогрессии
по возрастанию.


Данную задачу можно разделить на 2 подзадачи: сортировка элементов для удобного нахождения прогрессии и проверка достаточных условий.

- Для 1 подзадачи целесообразно будет использование массива.
- Для 2 подзадачи я выделил 4 варианта:
    1. `Все 4 числа образуют прогрессию.`
    2. `Прогрессию образуют 3 числа, идущих по порядку.` (2 варианта)  
    p - число, входящее в прогрессию. x - не входящее.
    - `[p, p, p, x] `
    - `[x, p, p, p]`
    3. `Прогрессию образуют 3 "разбитых" числа.`
    - `[p, x, p, p]`
    - `[p, p, x, p]`
    4. `Отсутствие прогрессии`

Всего необходимо рассмотреть `6` случаев.

### 2. Входные и выходные данные
На вход программа должна получать 4 натуральных числа, а следовательно целых. Верхняя граница получаемых
чисел не дана, нижняя - 1. Так как данные в процессе не преобразуются, а лишь анализируются, то данные на выход будут такими же. Единственное замечание - это то, что на выход могут быть поданы лишь 3 числа из 4 либо "NO"(тип String).

|             | Тип         | min значение | max значение |
|-------------|-------------|----------|--------------|
| A (Число 1) | Целое число |       1  | MaxInt       |
| B (Число 2) | Целое число |       1  | MaxInt       |
| C (Число 3) | Целое число |       1  | MaxInt       |
| D (Число 4) | Целое число |       1  | MaxInt       |
### 3. Выбор структуры данных

Программа получает 4 натуральных числа, для их хранения удобно выделить
целочисленный массив, содержащий 4 элемента.

|         | название переменной | Тип (в Java) | 
|---------|---------------------|--------------|
| A,B,C,D | `a`                 | `int []`     |

### 4. Алгоритм

#### Алгоритм выполнения программы:

1. **Ввод данных:**  
   Программа считывает 4 числа и помещает их в массив `a`.

2. **Сортировка чисел:**  
   С помощью встроенной функции `sort()` происходит упорядочивание чисел по возрастанию.

3. **Проверка существования прогрессии (для каждого случая), основанная на разности прогрессии:**
    - `d(1) = p(2) - p(1)`  `d(n) = p(n) - p(n-1)`

4. **Вывод результата:**  
   На экран выводится соответствующие значения в зависимости от условия. (p p p p или p p p или NO)

#### Блок-схема

```mermaid
graph TD
    A([Начало]) --> B[/создание массива a/]
    B --> C{int i =0}
    C --> D{i<a.lenght}
    D -- Нет --> I[/sort/]
    D -- Да --> F[/Ввод и добавление переменной в массив/]
    F -- i++ --> D
    I --> G{проверка условия 1}
    G -- Нет --> T{условие 2}
    G -- Да --> L{int i = 0}
    L --> M{i<a.lenght}
    M -- Нет --> Z([Конец])
    M -- Да --> O{Вывод элемента массива}
    O -- i++ --> M
    G -- Нет --> T{условие 2}
    T -- Да --> E{int i = 0}
    E --> H{i<a.lenght-1}
    H -- Нет --> Z
    H -- Да --> S{Вывод элемента массива}
    S -- i++ -->H
    T -- Нет --> V{условие 3}
    V -- Нет --> R{условие 4}
    V -- Да --> K{int i =1}
    K --> Q{i>a.lenght}
    Q -- Нет -->Z
    Q -- Да --> N{Вывод элемента массива}
    N -- i++ -->Q
    R -- Нет --> U{условие 5}
    R -- Да --> W{Вывод элементов массива по индексам}
    U -- Да --> X{Вывод элементов массива по индексам}
    U -- Нет --> Y{Вывод "NO"}
    Y --> Z
    X --> Z
    W --> Z
```

### 5. Программа

```java
import java.io.PrintStream;
import java.util.Scanner;
import java.util.Arrays;
public class Main {
    public static Scanner in = new Scanner(System.in);
    public static PrintStream out = System.out;
    public static void main(String[] args) {
        Scanner scan = new Scanner(System.in);
        int [] a = new int[4]; // создание массива
        for(int i = 0;i<a.length;i++)
            a[i] = scan.nextInt(); // заполнение массива
        Arrays.sort(a, 0, 4); // сортировка по возрастанию с 1 по 4 элемент
        if(a[3]-a[2]==a[2]-a[1]&&a[2]-a[1]==a[1]-a[0]){ // проверка условия, когда 4 числа создают арифметическую прогрессию и вывод 4 чисел.
            for(int i = 0;i<a.length;i++)
                out.print(a[i]+" ");
        }else if(a[2]-a[1]==a[1]-a[0]){
            for(int i = 0;i<a.length-1;i++)
                out.print(a[i]+" ");
        }else if(a[3]-a[2]==a[2]-a[1]){
            for(int i = 1;i<a.length;i++)
                out.print(a[i]+" ");
        }else if(a[3]-a[1]==a[1]-a[0]){
            out.printf("%d ",a[0]);
            out.printf("%d ",a[1]);
            out.print(a[3]);
        }else if(a[3]-a[2]==a[2]-a[0]){
            out.printf("%d ",a[0]);
            out.printf("%d ",a[2]);
            out.print(a[3]); // проверка всех возможных случаев расположения трех элементов среди четырех мест и вывод соответствующих последовательностей
        }else{
            out.print("NO"); // вывод, если среди вводных данных не содержится прогрессия
        }
    }

}

```

### 6. Анализ правильности решения

Программа работает корректно на всем множестве решений с учетом ограничений.

1. Тест на `p<p<p<p`:

    - **Input**:
        ```
        11 9 5 7
        ```

    - **Output**:
        ```
        5 7 9 11
        ```

2. Тест на `p<p<p<x`:

    - **Input**:
        ```
        6 765 26 46
        ```

    - **Output**:
        ```
        6 26 46
        ```

3. Тест на `x<p<p<p`:

    - **Input**:
        ```
        16 4 3 10
        ```

    - **Output**:
        ```
        4 10 16
        ```

4. Тест на `p<x<p<p`:

    - **Input**:
        ```
        10 15 9 5
        ```

    - **Output**:
        ```
        5 10 15
        ```

5. Тест на `p<p<x<p``:

    - **Input**:
        ```
        60 54 36 12
        ```

    - **Output**:
        ```
        12 36 60
        ```
6. Тест на вывод "NO""`:

    - **Input**:
        ```
        2 4 5 7
        ```

    - **Output**:
        ```
        NO
        ```
      `Также на каждом примере я демонстрирую работу функции sort(), меняя порядок вводных данных.`